var dgry_types_building_types = {
    "1": "主城",
    "2": "金库",
    "3": "木材库",
    "4": "石材库",
    "5": "民房",
    "6": "锯木厂",
    "7": "采石场",
    "8": "保险库",
    "9": "战争学院",
    "10": "远征营地 ",

    "12": "热气球",
    "13": "城墙",

    "15": "箭塔 ",

    "17": "火药桶",
    "18": "炮塔",

    "20": "图书馆",
    "21": "高塔",
    "22": "弩箭塔",
    "23": "火炮塔",
    "24": "火箭塔",
    "25": "弩炮塔",
    "26": "投石塔",
    "27": "援军营地",
    "28": "佣兵营地",
    "29": "守备营地",
    "30": "巨型炸弹",
    "99": "宝箱"
    };

var dgry_types_building_time_type = {
    "0": "就绪",
    "1": "<span style=\"color:blue;\">建造中</span>",
    "2": "<span style=\"color:red;\">升级中</span>"
};

var dgry_types_enemy_type = {
    "0": "空",
    "1": "小怪",
    "2": "boss",
    "3": "活动岛",
    "4": "玩家",
    "5": "宝箱",
    "6": "被占资源岛",
    "7": "己方资源岛",
};